{
    "experience": [
        {
            "companyName": "Financial Times",
            "timeframe": "April 2018 - Present",
            "role": "Software Engineer",
            "description": "FT is one of the world’s leading business news and information organisations.",
            "achivements": [
                "I joined the company as the first developer in Sofia. This have alowed me to participate in various activities outside programming - interviewing, improving the onboarding process, directly influence the culture and mindset.",
                "I started in the newspaper team where we had the responsibility to migrate users from third party system.",
                "I am participating in the knowledge transfer from London of Membership systems - around 100 microservices responsible of access and identity, subscriptions, payments, newspaper systems, reporting, etc."
            ]
        },
        {
            "companyName": "Chobolabs",
            "timeframe": "March 2016 - May 2017 (~1.5 years)",
            "role": "Backend & Tools Engineer",
            "description": "Innovative game startup of 20 people trying to bring e-sports to mobile. The flagship game called Mayhem is Series A funded project.",
            "achivements": [
                "I got used to DYI mindset & code generation using custom DSL.",
                "I created the \"Chatter Protocol\" - It allows using Chobolabs's DSL to generate inter-microservice communication protocol that exposes clean pub/sub style typed interface.",
                "Managed the infrastructure - using AWS/Packer/Terraform.",
                "I was responsible for third party services integrations like monitoring & alarm service (Datadog), data analytics (DeltaDNA+Cloudant).",
                "Chobo Backyard - Angular admin panel that can generate forms using type info from the backend.",
                "I helped QA team to be more effective by creating automation tools.",
                "Solved real time communication issue - We needed to be able to implement features like chat or notify users for events in real time."
            ]
        },
        {
            "companyName": "Obecto",
            "timeframe": "March 2013 - Nov. 2015 (~2.5 years)",
            "role": "Full Stack Engineer",
            "description": "Team of 20 professionals working in small teams with startups. Every employee is motivated to become expert in the domain.",
            "achivements": [
                "Learned to work in small and self-contained full-stack teams, working with clients (mostly startups) to achieve their business goal while improving as engineer",
                "Hired By Me - Platform that facilitates hiring in UK. I had the chance to work with very strong and methodological team. We used all good practices that made sense - code reviews, ownership of problems, scrum and knowledge sharing. We used Spring and Angular.",
                "Wintergarden - An Universum project. I worked with the same team as in Hired By Me. One of my tasks was engineer an e-mail-like feature",
                "SoTexy - Platform that allowed matching people to their perfect career. I owned the engineering side and worked closely with the business and lead small team of 2.",
                "10+ smaller projects utilising various tech. stacks"
            ]
        },
        {
            "companyName": "Buzlylabs",
            "timeframe": "Oct. 2011 - Dec. 2012 (~2 years)",
            "role": "iOS Developer",
            "description": "Small team creating Android and iOS applications and games.",
            "achivements": [
                "Developed 5 iOS games & applications.",
                "Appshawk - Application that displays paid apps that are free for limited time. With this app we applied for funding in the very first Bulgarian incubator, which was my first experience with the startup world.",
                "Puzzle Lab - After being rejected we teamed up with one other design team and created a logic game containing micro-games. I developed 1 of the micro-games - Concentration - memorizing and matching pairs of cards.",
                "I also completely rewritten an air hocky game (with Box2d as physics engine) and developed a PoC for multiplayer mode."
            ]
        }
    ]
}
